In [1]:
people={"first":["Rajat","corey","John"],
        "last":["Gupta","sch","doe"],
        "email":["RajatGupta@email.com","corey@email.com","john@email.com"]}

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("survey_results_public.csv")

In [4]:
df2=pd.DataFrame(people)

In [5]:
df2

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    sch       corey@email.com
2   John    doe        john@email.com

In [6]:
people["email"]

['RajatGupta@email.com', 'corey@email.com', 'john@email.com']

In [8]:
df2["email"]

0    RajatGupta@email.com
1         corey@email.com
2          john@email.com
Name: email, dtype: object

In [9]:
type(df2["email"])

pandas.core.series.Series

In [10]:
type(people["email"])

list

In [11]:
df2.email

0    RajatGupta@email.com
1         corey@email.com
2          john@email.com
Name: email, dtype: object

In [13]:
df2[["email","last"]]

                  email   last
0  RajatGupta@email.com  Gupta
1       corey@email.com    sch
2        john@email.com    doe

In [14]:
df.columns

Index(['Respondent', 'MainBranch', 'Hobbyist', 'Age', 'Age1stCode', 'CompFreq',
       'CompTotal', 'ConvertedComp', 'Country', 'CurrencyDesc',
       'CurrencySymbol', 'DatabaseDesireNextYear', 'DatabaseWorkedWith',
       'DevType', 'EdLevel', 'Employment', 'Ethnicity', 'Gender', 'JobFactors',
       'JobSat', 'JobSeek', 'LanguageDesireNextYear', 'LanguageWorkedWith',
       'MiscTechDesireNextYear', 'MiscTechWorkedWith',
       'NEWCollabToolsDesireNextYear', 'NEWCollabToolsWorkedWith', 'NEWDevOps',
       'NEWDevOpsImpt', 'NEWEdImpt', 'NEWJobHunt', 'NEWJobHuntResearch',
       'NEWLearn', 'NEWOffTopic', 'NEWOnboardGood', 'NEWOtherComms',
       'NEWOvertime', 'NEWPurchaseResearch', 'NEWPurpleLink', 'NEWSOSites',
       'NEWStuck', 'OpSys', 'OrgSize', 'PlatformDesireNextYear',
       'PlatformWorkedWith', 'PurchaseWhat', 'Sexuality', 'SOAccount',
       'SOComm', 'SOPartFreq', 'SOVisitFreq', 'SurveyEase', 'SurveyLength',
       'Trans', 'UndergradMajor', 'WebframeDesireNextYear',
       'WebframeWorkedWith', 'WelcomeChange', 'WorkWeekHrs', 'YearsCode',
       'YearsCodePro'],
      dtype='object')

In [15]:
df2.iloc[0]

first                   Rajat
last                    Gupta
email    RajatGupta@email.com
Name: 0, dtype: object

In [16]:
df2.loc[0]

first                   Rajat
last                    Gupta
email    RajatGupta@email.com
Name: 0, dtype: object

In [18]:
df2.iloc[0,1]

'Gupta'

In [20]:
df2.loc[0,"last"]

'Gupta'

In [24]:
df2.iloc[[0,1],1]

0    Gupta
1      sch
Name: last, dtype: object

In [26]:
df2.loc[[0,1],"last"]

0    Gupta
1      sch
Name: last, dtype: object

In [27]:
df2.loc[[0,1],["first","last"]]

   first   last
0  Rajat  Gupta
1  corey    sch

In [29]:
df2.iloc[[0,1],[0,1]]

   first   last
0  Rajat  Gupta
1  corey    sch

In [31]:
df.loc[:,"Hobbyist"]

0        Yes
1         No
2        Yes
3        Yes
4        Yes
        ...
64456    Yes
64457    Yes
64458    Yes
64459    Yes
64460    Yes
Name: Hobbyist, Length: 64461, dtype: object

In [32]:
df["Hobbyist"]

0        Yes
1         No
2        Yes
3        Yes
4        Yes
        ...
64456    Yes
64457    Yes
64458    Yes
64459    Yes
64460    Yes
Name: Hobbyist, Length: 64461, dtype: object

In [33]:
df["Hobbyist"].value_counts()

Yes    50388
No     14028
Name: Hobbyist, dtype: int64

In [44]:
df.loc[:,"Hobbyist":"Country"]

,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country
0,Yes,NaN,13,Monthly,NaN,NaN,Germany
1,No,NaN,19,NaN,NaN,NaN,United Kingdom
2,Yes,NaN,15,NaN,NaN,NaN,Russian Federation
3,Yes,25.0,18,NaN,NaN,NaN,Albania
4,Yes,31.0,16,NaN,NaN,NaN,United States
...,...,...,...,...,...,...,...
64456,Yes,NaN,16,NaN,NaN,NaN,United States
64457,Yes,NaN,NaN,NaN,NaN,NaN,Morocco
64458,Yes,NaN,NaN,NaN,NaN,NaN,Viet Nam
64459,Yes,NaN,NaN,NaN,NaN,NaN,Poland
64460,Yes,NaN,NaN,NaN,NaN,NaN,Spain

In [37]:
df

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
1,2,I am a developer by profession,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4
2,3,I code primarily as a hobby,Yes,NaN,15,NaN,NaN,NaN,Russian Federation,NaN,...,Neither easy nor difficult,Appropriate in length,NaN,NaN,NaN,NaN,Somewhat more welcome now than last year,NaN,4,NaN
3,4,I am a developer by profession,Yes,25.0,18,NaN,NaN,NaN,Albania,Albanian lek,...,NaN,NaN,No,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat less welcome now than last year,40.0,7,4
4,5,"I used to be a developer by profession, but no...",Yes,31.0,16,NaN,NaN,NaN,United States,NaN,...,Easy,Too short,No,"Computer science, computer engineering, or sof...",Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
64456,64858,NaN,Yes,NaN,16,NaN,NaN,NaN,United States,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,NaN,NaN,10,Less than 1 year
64457,64867,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Morocco,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64458,64898,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Viet Nam,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64459,64925,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Poland,NaN,...,NaN,NaN,NaN,NaN,Angular;Angular.js;React.js,NaN,NaN,NaN,NaN,NaN
64460,65112,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Spain,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",ASP.NET Core;jQuery,Angular;Angular.js;ASP.NET Core;jQuery,NaN,NaN,NaN,NaN

In [45]:
df.loc[2:9,"Hobbyist":"Country"]

,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country
2,Yes,NaN,15,NaN,NaN,NaN,Russian Federation
3,Yes,25.0,18,NaN,NaN,NaN,Albania
4,Yes,31.0,16,NaN,NaN,NaN,United States
5,No,NaN,14,NaN,NaN,NaN,Germany
6,Yes,NaN,18,Monthly,NaN,NaN,India
7,Yes,36.0,12,Yearly,116000.0,116000.0,United States
8,No,30.0,20,NaN,NaN,NaN,Tunisia
9,Yes,22.0,14,Yearly,25000.0,32315.0,United Kingdom